[
  {
    "id": 1,
    "formationName": "Comprendre la démarche Agile",
    "category": "Compétences transverses",
    "subCategory": "Agilité",
    "description": "Comprendre les concepts de la méthode agile",
    "descriptionDetail": "Pour quelles raisons entend-on autant parler de démarches agiles ? En quoi cela consiste-t-il ? Quels impacts cela entraine-t-il dans le fonctionnement d'une équipe et, plus largement, dans celui de l'entreprise ? Quels changements dans le management ? Avant d'adopter les méthodes de travail et le management agiles et de réaliser un premier projet reposant sur cette nouvelle approche, il est nécessaire de se familiariser avec ses concepts. C'est précisément dans cet objectif qu'a été conçue cette formation au cours de laquelle les participants s'approprieront la culture et le vocabulaire propres à l'agilité avant de découvrir les méthodes les plus en vogue actuellement et de comprendre comment les mettre en oeuvre dans le cadre d'un projet. ",
    "duree": 3,
    "price": 399,
    "difficulty": 1,
    "lieux": [ "Paris", "Lille" ],
    "startDate": [ "02 janvier 2023", "30 juin 2023" ],
    "endDate": "",
    "logo": "./img/demarche-agile.jpg",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 2,
    "formationName": "Travailler en équipe Agile",
    "category": "Compétences transverses",
    "subCategory": "Agilité",
    "description": "Mettre en pratique les concepts de la méthode Agile sur des projets en équipe",
    "descriptionDetail": "Vous comprendrez et mettrez en œuvre les méthodes agiles. Vous testerez et utiliserez l’intégration continue. Vous piloterez un projet en suivant cette méthode, tout en connaissant les bonnes pratiques. Vous devez avoir des notions en gestion de projets pour suivre cette formation, qui permet d’obtenir une certification ISQ-OPQF.",
    "duree": 5,
    "price": 499,
    "difficulty": 1,
    "lieux": [ "Paris", "Lille" ],
    "startDate": [ "15 janvier 2023", "30 septembre 2023" ],
    "endDate": "",
    "logo": "./img/equipe-agile-2.jpg",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 3,
    "formationName": "Product Owner",
    "category": "Compétences transverses",
    "subCategory": "Agilité",
    "description": "Se former au métier de Product Owner",
    "descriptionDetail": "Dans une démarche Agile, le Responsable de Produit (ou Product Owner) est un acteur clé pour la réussite du projet. Ce stage vous apportera les connaissances essentielles pour comprendre le cadre et le rôle défini pour le Product Owner. Il vous préparera aux questions d’examen en vue du passage de la certification. ",
    "duree": 5,
    "price": 799,
    "difficulty": 3,
    "lieux": [ "Paris", "Lille" ],
    "startDate": [ "02 janvier 2023", "15 octobre 2023" ],
    "endDate": "",
    "logo": "./img/product-owner.jpg",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 4,
    "formationName": "Pilotage de projets",
    "category": "Compétences transverses",
    "subCategory": "Gestion de projets",
    "description": "Maitriser et piloter un projet de A à Z",
    "descriptionDetail": "Lorsque dans une entreprise les projets sont nombreux, s'interpénètrent et mettent en jeu des acteurs de métiers différents, il devient impératif de mettre en place une gestion adaptée. Planifier, établir les rôles et les responsabilités de chacun, arbitrer et communiquer sont les clés du management multiprojets. ",
    "duree": 14,
    "price": 699,
    "difficulty": 3,
    "lieux": [ "Paris", "Lille" ],
    "startDate": [ "15 janvier 2023", "30 mai 2023" ],
    "endDate": "",
    "logo": "./img/pilotage-projet.jpg",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 5,
    "formationName": "Prise de parole en public",
    "category": "Compétences transverses",
    "subCategory": "Gestion de projets",
    "description": "Développer ses techniques de communication orales",
    "descriptionDetail": "Maîtriser les techniques de communication face à  un auditoire professionnel : managers, managés, collègues, partenaires, clients, différents services de l'entreprise - Prendre confiance en soi - Déveloper ses capacités d'expression orale - Structurer ses exposés - Gérer son stress et son trac - Préparer et animer des réunions de façon professionnelle avec des publics internes et externes variés - Gérer les cas difficiles",
    "duree": 5,
    "price": 450,
    "difficulty": 2,
    "lieux": [ "Paris", "Lille" ],
    "startDate": [ "02 mars 2023", "02 novembre 2023" ],
    "endDate": "",
    "logo": "./img/prise-de-parole.jpg",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 6,
    "formationName": "LEAN Management",
    "category": "Compétences transverses",
    "subCategory": "Gestion de projets",
    "description": "Acquérir les principes du LEAN management, l'amélioration continue, la conduite du changement...",
    "descriptionDetail": "Avec le Lean Management, on sait faire plus vite et moins cher tout en maîtrisant la qualité. Le Lean permet également aux équipes plus d'autonomie et d'agilité vers l'excellence opérationnelle. Le chemin vers le Lean passe par la prise de conscience des gains potentiels, par la suppression des gaspillages dans les processus et enfin par l'ancrage des comportements de progrès auprès des équipes. Cette formation permet à chaque entreprise de tracer son chemin, selon la maturité de ses systèmes et de ses acteurs, avec des principes et des outils qui font leur preuve aujourd'hui dans tous les secteurs de l'industrie et des services.",
    "duree": 3,
    "price": 350,
    "difficulty": 2,
    "lieux": [ "Paris", "Lille" ],
    "startDate": [ "01 avril 2023", "30 octobre 2023" ],
    "endDate": "",
    "logo": "./img/lean.jpg",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 7,
    "formationName": "SQL : les fondamentaux",
    "category": "Bases de données et langages",
    "subCategory": "Base de données",
    "description": "Comprendre les bases de données relationnelles et leurs principes de fonctionnement",
    "descriptionDetail": "Devant le nombre sans cesse croissant d'informations gérées par les entreprises, le recours aux systèmes de gestion de bases de données est naturellement amené à se généraliser. Il n'est d'ailleurs pas rare de voir cohabiter dans une même entreprise plusieurs SGBD-R tels que SQL Server, Oracle, MySQL... La maîtrise du langage SQL permettra aux administrateurs et développeurs de bases de données d'exploiter les informations de l'entreprise quel que soit le système qui les héberge. Cette formation prépare à la certification Langage SQL : Exploiter une base de données relationnelle. ",
    "duree": 4,
    "price": 399,
    "difficulty": 2,
    "lieux": [ "Paris", "Lille" ],
    "startDate": [ "06 avril 2023", "30 septembre 2023" ],
    "endDate": "",
    "logo": "./img/sql-2.png",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 8,
    "formationName": "Big Data : Architecture et Infrastructure",
    "category": "Bases de données et langages",
    "subCategory": "Base de données",
    "description": "Exploiter les architectures Big Data et mettre en place les socles techniques pour des projets Big Data",
    "descriptionDetail": "Comprendre les besoins métier pour livrer aux décideurs des indicateurs fiables et pertinents, tel est le rôle attendu des spécialistes Big Data. Précisément conçu pour leur apprendre à mettre en oeuvre une solution de Big Data en environnement Hadoop, solution phare pour les traitements Big Data, ce programme reprend le cheminement logique d'un projet d'analyse de données. De leur collecte initiale à la mise en place de solutions de stockage spécifiques permettant d'organiser un très grand volume d'information, à la réalisation de scripts Pig et Hive qui, convertis en tâches MapReduce, permettent d'agréger et de filtrer les données pour finalement les analyser, tous les aspects seront abordés. ",
    "duree": 5,
    "price": 599,
    "difficulty": 4,
    "lieux": [ "Paris", "Lille" ],
    "startDate": [ "02 mai 2023", "30 septembre 2023" ],
    "endDate": "",
    "logo": "./img/big-data.jpg",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 9,
    "formationName": "Langage SQL : avancé",
    "category": "Bases de données et langages",
    "subCategory": "Base de données",
    "description": "Approfondir ses connaissances du langage SQL",
    "descriptionDetail": "Il existe plusieurs moyens d'exécuter des commandes PL/SQL : dans un interpréteur standard (SQL+), sous forme de fichiers de commandes, ou par l'intermédiaire de procédures stockées, de fonctions ou encore de packages. Ces derniers étant comparables à de véritables programmes qui offrent de réelles possibilités pour structurer clairement son code et ainsi le rendre plus facilement maintenable par la suite. A l'issue de cette formation avancée, les participants disposeront des compétences nécessaires à l'écriture de fonctions élaborées puis de packages, déclinaison la plus aboutie du PL/SQL. ",
    "duree": 3,
    "price": 399,
    "difficulty": 3,
    "lieux": [ "Paris", "Lille" ],
    "startDate": [ "15 mai 2023", "20 octobre 2023" ],
    "endDate": "",
    "logo": "./img/sql-2.png",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 10,
    "formationName": "JavaScript : fondamentaux",
    "category": "Bases de données et langages",
    "subCategory": "Langages de développement",
    "description": "Découvrir les bases du langage JavaScript et son utilisation sur le web",
    "descriptionDetail": "Un temps délaissé, JavaScript est revenu sur le devant de la scène avec l'émergence du Web 2.0. Son utilisation permet de rendre les pages web plus interactives et conviviales pour l'internaute. Sa maîtrise est aussi un préalable indispensable avant d'aborder le développement d'applications Internet riches avec Ajax (Asynchronous JavaScript ans XML).",
    "duree": 3,
    "price": 499,
    "difficulty": 2,
    "lieux": [ "Lille", "Paris" ],
    "startDate": [ "03 janvier 2023", "30 Juin 2023" ],
    "endDate": "",
    "logo": "./img/logo-js.png",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 11,
    "formationName": "ReactJS : Développement d'applications Web",
    "category": "Bases de données et langages",
    "subCategory": "Langages de développement",
    "description": "Développer des interfaces utlisateurs dynamiques à l'aide de ReactJS",
    "descriptionDetail": "Bibliothèque JavaScript développée par Facebook depuis 2013, ReactJS voit sa popularité exploser. Certains acteurs de la nouvelle économie tels que Netflix, Airbnb ou encore WhatsApp ont d'ailleurs adopté ce moteur de rendu JavaScript qui se démarque de ses concurrents par sa flexibilité et ses performances principalement dues au fait qu'il ne met à jour le rendu de page web dans le navigateur qu'en cas de nécessité. A l'issue de cette formation, les participants disposeront des connaissances et compétences nécessaires au développement d'interfaces utilisateur avec le framework ReactJS. ",
    "duree": 5,
    "price": 699,
    "difficulty": 3,
    "lieux": [ "Lille", "Paris" ],
    "startDate": [ "03 janvier 2023", "30 juin 2023" ],
    "endDate": "",
    "logo": "./img/logo-react.png",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 12,
    "formationName": "C # - .NET",
    "category": "Bases de données et langages",
    "subCategory": "Langages de développement",
    "description": "Apprendre les bases du langage C# et découvrir l'environnement .NET",
    "descriptionDetail": "Créé par Microsoft pour que la plateforme Microsoft .NET soit dotée d'un langage permettant d'utiliser toutes ses capacités, le C# est un langage de programmation orienté objet (proche du Java) aujourd'hui largement utilisé par les développeurs. Afin de maîtriser les concepts liés aux développements d'applications .Net, ceux-ci doivent aujourd'hui maîtriser les briques de la programmation objet afin de réaliser des applications plus modulaires par la mise en oeuvre de composants réutilisables. Cette formation apporte précisément aux programmeurs les bases du C# (syntaxe et concepts objets) ainsi qu'une introduction au développement avec .Net 5, dernière version du framework .Net Core, multi plateforme initié par Microsoft. ",
    "duree": 5,
    "price": 750,
    "difficulty": 3,
    "lieux": [ "Lille", "Paris" ],
    "startDate": [ "02 janvier 2023", "30 juin 2023" ],
    "endDate": "",
    "logo": "./img/logo-csharp.png",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 13,
    "formationName": "C # - .NET Core - Développement Avancé",
    "category": "Bases de données et langages",
    "subCategory": "Langages de développement",
    "description": "Mettre en oeuvre les concepts avancés du .NET Core et du langage C#",
    "descriptionDetail": "La nature des applications actuelles est fortement basée sur les données, quelles que soient leur forme (serveur de bases de données, XML, JSON...). En complément des compétences traditionnelles nécessaires aux développements d'applications, les développeurs doivent donc aujourd'hui maîtriser les briques ADO du Framework .Net pour garantir un accès de qualité aux données. Par la mise en oeuvre de modèles de conception tels que MVC ou MVVM, l'accès aux données se veut de plus en plus détaché des bases de données et fait souvent intervenir un mappage objet-relationnel, ce qui a été pris en compte par l'introduction d'Entity Framework. Cette formation apporte précisément aux programmeurs les bases d'ADO .Net et d'Entity Framework qui leur permettront d'intégrer rapidement des projets ou des équipes de développement utilisant ces standards. ",
    "duree": 5,
    "price": 750,
    "difficulty": 4,
    "lieux": [ "Lille", "Paris" ],
    "startDate": [ "03 janvier 2023", "30 Juin 2023" ],
    "endDate": "",
    "logo": "./img/logo-dotnetcore.png",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 14,
    "formationName": "Python - Par la pratique",
    "category": "Bases de données et langages",
    "subCategory": "Langages de développement",
    "description": "Apprendre à programmer en langage Python",
    "descriptionDetail": "Issu du monde Open Source, Python est un langage réputé facile d'accès, simple et particulièrement portable. Il propose aux développeurs un ensemble d'outils et de fonctionnalités facilitant leurs tâches (piles de modules, pas de nécessité de compilation, débuggeur intégré, Shell de tests, documentation riche...). Mais avant de pouvoir bénéficier de tous ces avantages, les nouveaux développeurs Python devront s'approprier les notions essentielles de programmation objet et apprendre la syntaxe du langage. En suivant cette formation de 5 jours, les participants couvriront tous les sujets leur permettant de concevoir, développer, déployer et maintenir des applications Python. Cette formation prépare à la certification TOSA Python",
    "duree": 14,
    "price": 850,
    "difficulty": 5,
    "lieux": [ "Lille", "Paris" ],
    "startDate": [ "03 janvier 2023", "15 septembre 2023" ],
    "endDate": "",
    "logo": "./img/python.jpg",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 15,
    "formationName": "C ++ : Mise à niveau",
    "category": "Bases de données et langages",
    "subCategory": "Langages de développement",
    "description": "Identifier et comprendre les nouveautés du langage C++",
    "descriptionDetail": "C++ est un langage de choix pour réaliser des applications évolutives, robustes et efficaces. Cette performance a cependant un prix : elle suppose de la part du développeur une réelle maîtrise, tant au niveau de la syntaxe que des concepts sous-jacents tels que les modèles mémoire, l'orientation objet ou encore la généricité. Cette formation permettra aux participants d'appréhender les principes fondamentaux de la conception objet et de les appliquer de façon effective en C++.        Cette formation prépare à la certification CPA - C++ Certified Associate Programmer. ",
    "duree": 3,
    "price": 299,
    "difficulty": 2,
    "lieux": [ "Lille", "Paris" ],
    "startDate": [ "03 janvier 2023", "04 novembre 2023" ],
    "endDate": "",
    "logo": "./img/cplus.png",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 16,
    "formationName": "ITIL 4 - Stratégies",
    "category": "SI et réseaux",
    "subCategory": "Système d'information",
    "description": "Créer une organisation informatique centrée sur l’apprentissage et l’amélioration+",
    "descriptionDetail": "La technologie a transformé notre façon de travailler, de socialiser, d'acheter des biens et d'interagir avec les services. Les consommateurs et les utilisateurs attendent désormais davantage, ce qui met la pression sur les fournisseurs pour qu'ils fournissent plus rapidement des produits et services informatiques de meilleure qualité. La fourniture de produits et services informatiques a également été transformée par des technologies telles que le cloud. Parallèlement à cela, les organisations sont plus que jamais tenues responsables des impacts sociaux et environnementaux de leurs activités.Ce module complémentaire étend le cadre de référence ITIL 4 et fournissent aux organisations les conseils nécessaires pour relever et exploiter les défis et les opportunités présentés par les technologies et les thèmes émergents qui ont un impact sur leurs opérations. Cette formation prépare à la certification ITIL® 4 Specialist - Acquiring and Managing Cloud Services et inclus le voucher pour passer l'examen. ",
    "duree": 5,
    "price": 450,
    "difficulty": 2,
    "lieux": [ "Lille", "Paris" ],
    "startDate": [ "03 janvier 2023", "30 juin 2023" ],
    "endDate": "",
    "logo": "./img/itil-4.png",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 17,
    "formationName": "Control-M 20.x Fundamental Using",
    "category": "SI et réseaux",
    "subCategory": "Système d'information",
    "description": "Apprendre le fonction de Control-M 20.x",
    "descriptionDetail": "Cette formation fournit aux professionnels de l'informatique les concepts et l'expérience pratique de l'utilisation de produits Control-M distribués pour surveiller et gérer leurs environnements de production, y compris la création de définitions de tâches. Elle explore les fonctionnalités de l'interface d'automatisation de la charge de travail Control-M, un outil de surveillance et de gestion pour l'environnement de planification des lots d'entreprise. Vous apprendrez à gérer le traitement du travail sur toutes les plates-formes prises en charge par Control-M/Server et Control-M/Agent, y compris la création, la planification et le déploiement de définitions de traitement de job en utilisant le domaine de planification. ",
    "duree": 3,
    "price": 300,
    "difficulty": 3,
    "lieux": [ "Lille", "Paris" ],
    "startDate": [ "3 Janvier 2023", "28 mai 2023" ],
    "endDate": "",
    "logo": "./img/control-m.jpg",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 18,
    "formationName": "Transformation digitale",
    "category": "SI et réseaux",
    "subCategory": "Système d'information",
    "description": "Identifier, décrire et transmettre les enjeux de la transformation digitale en entreprise",
    "descriptionDetail": "Le digital touche toutes les fonctions de l’entreprise, il est un des leviers d’innovation et de développement. Cette formation a pour but d'identifier les enjeux de la transformation digitale et de vous aider à définir la stratégie à mettre en oeuvre dans votre entreprise. Au-delà des outils et des process, la transformation numérique amène aussi à repenser le management avec de nouvelles logiques de partage et de collaboration. La transformation digitale engage, en réalité, un changement plus culturel et humain que technologique. Cette formation vous donnera les clés de réussite pour démarrer et accompagner un projet de transformation numérique adapté à votre votre contexte. Cette formation peut être associée à la Certification DiGiTT. ",
    "duree": 2,
    "price": 250,
    "difficulty": 1,
    "lieux": [ "Lille", "Paris" ],
    "startDate": [ "04 mars 2023", "30 juin 2023" ],
    "endDate": "",
    "logo": "./img/digitalisation.jpg",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 19,
    "formationName": "Introduction et pratique des réseaux",
    "category": "SI et réseaux",
    "subCategory": "Réseaux",
    "description": "Décrire les concepts, la normalisation et la terminologie du réseau",
    "descriptionDetail": "Cette formation propose un tour d'horizon complet de l'arsenal des outils disponibles pour assurer la sécurité des environnements Windows. Pour une efficacité maximale des contre-mesures, l'approche adoptée est la suivante : on considère que des intrusions ont déjà eu lieu et qu'il importe de limiter les dégâts d'une part en protégeant les identifiants utilisés pour l'administration et d'autre part en s'assurant que les administrateurs ne peuvent effectuer que les tâches qui leur sont assignées, et ce uniquement lorsque nécessaire. ",
    "duree": 2,
    "price": 250,
    "difficulty": 1,
    "lieux": [ "Lille", "Paris" ],
    "startDate": [ "04 février 2023", "30 septembre 2023" ],
    "endDate": "",
    "logo": "./img/reseaux.jpg",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  },
  {
    "id": 20,
    "formationName": "Virtualisation des réseaux SDN et NFV",
    "category": "SI et réseaux",
    "subCategory": "Réseaux",
    "description": "Comprendre les fondamentaux de la virtualisation du réseau",
    "descriptionDetail": "Nous vous proposons un état de l'art complet du domaine émergeant de la virtualisation de réseaux et des impacts sur la transition digitale et le Cloud Networking. Après une introduction présentant le marché et les mutations de la virtualisation dans le Cloud, le séminaire détaille une étude approfondie des réseaux logiciels SDN (Software Defined Network) ainsi que la normalisation en cours NFV (Network Function Virtualization). ",
    "duree": 3,
    "price": 400,
    "difficulty": 3,
    "lieux": [ "Lille", "Paris" ],
    "startDate": [ "06 mars 2023", "15 septembre 2023" ],
    "endDate": "",
    "logo": "./img/virtualisation.jpg",
    "status": "",
    "studentsNumber": 0,
    "studentsList": [],
    "teacher": {},
    "todoList": {}
  }
]
